<script setup>
import stQuote from "@/components/Card/st-quote.vue";
import { flyweightmodehead } from "../data/designmode/flyweightmode";
</script>

<template>
  <div>
    <h2>享元模式</h2>
    <div>
      <stQuote class="mg-b10" :ctx="flyweightmodehead" />
    </div>

    <div>
      <div>
        <h3>1.初始享元模式</h3>
        <div>
          假设有个内衣工厂，目前有50种男士内衣和50种女士内衣，为了推销，工厂订了一批塑料模特。
          正常情况下需要男女各50个模特，然后让他们每人分别穿上意见内衣拍摄。
          <br />
          最后要得到一张照片，50男50女，所以会产出100张照片，若有10000种内衣呢。<br />
          接下来考虑优化一下场景，虽然有100种内衣，但很显然并不需要50个男模特和50个女模特，分别要一个就够了。
          这样同样的场景下，只需要2个对象的产出和100个对象的产出是一样的，节省了内存。
        </div>
      </div>

      <div>
        <h3>2.内部状态和外部状态</h3>
        <div>
          上述例子是享元模式的雏形，享元模式要求将对象的属性划分为内部状态与外部
          状态（状态在这里通常指属性）。享元模式的目标是尽量减少共享对象的数量，关于如何划分内
          部状态和外部状态，下面的几条经验提供了一些指引。
          <br />
          1.内部状态存储于对象内部 <br />
          2.内部状态可以被一些对象共享。 <br />
          3.内部状态独立于具体的场景，通常不会改变。<br />
          4.外部状态取决于具体的场景，并根据场景而变化，外部状态不能被共享。
          <br />这样一来，我们便可以把所有内部状态相同的对象都指定为同一个共享的对象。而外部状态
          可以从对象身上剥离出来，并储存在外部。
          <br />
          在上面的例子里，性别是内部状态，内衣是外部状态，通过区分这两者状态，可以减少系统的对象数量。
          通常来说，内部状态有多少种组合，系统中便存在多少对象，因为性别通常是2种，所以对应2个对象。
          <br />
          使用享元模式的关键是如何区别内部状态和外部状态。可以被对象共享的属性通常被划分为
          内部状态，如同不管什么样式的衣服，都可以按照性别不同，穿在同一个男模特或者女模特身上，
          模特的性别就可以作为内部状态储存在共享对象的内部。而外部状态取决于具体的场景，并根据
          场景而变化，就像例子中每件衣服都是不同的，它们不能被一些对象共享，因此只能被划分为外
          部状态。
        </div>
      </div>
    </div>
  </div>
</template>

<style lang="less" scoped>
pre {
  padding-left: 10px !important;
}
</style>
