<script setup>
import stQuote from "@/components/Card/st-quote.vue";
import {
  publishsubscriptionmodehead,
  codedemo,
  codedemo2,
} from "../data/designmode/publishsubscriptionmode";
</script>

<template>
  <div>
    <h2>发布订阅模式</h2>
    <div>
      <p>前言：</p>
      <stQuote class="mg-b10" :ctx="publishsubscriptionmodehead" />
    </div>

    <div>
      <h3>1.买房例子</h3>
      <div>
        无论在程序里还是现实，发布订阅模式（观察者）的应用都非常广泛：<br />
        小明最近看上了一个房子，到了售楼处才被告知，房子卖完了，所以小明记下售楼处电话，每天都问一问。
        这下客服难受了，因为每天需要回答非常多相同的问题。<br />
        当然现实不会这么笨，当有了新房后，售楼处会通知有需求的客户。
      </div>
    </div>

    <div>
      <h3>2.发布订阅模式的作用</h3>
      <div>
        上述例子就是一个典型的发布订阅模式。它有两个明显的优点：<br />
        1.购房者不需要每天打电话查询是否有新房，而是由售楼处发出消息进行通知。<br />
        2.购房者和售楼处之间不再是强耦合的关系，比如无论对象是男是女，是猴子是大象，无论客服是否离职，
        只要售楼处记得放消息即可。<br />

        第一点说明发布订阅模式广泛使用于异步编程中，这是一种替代传递回调函数的方案，比如当动画的每一帧完成后做的事情，我们就可用订阅一个事件，在每一帧动画完成后发布这个事件。
        在异步编程里使用发布订阅模式，无需关注对象在异步运行期间的内部状态，只需要订阅感兴趣的事件发生点。
        <br />
        第二点说明发布订阅模式可以取代对象之间硬编码的通知机制，一个对象不再显式调用另一个对象的某个接口。
        发布订阅模式让两个对象松耦合的联系到一起，虽然不太清楚细节，但不影响相互通信。当有新的订阅者出现的时候，发布者的代码无需修改，反之亦然。
      </div>
    </div>

    <div>
      <h3>3.dom事件</h3>
      <div>
        只要我们曾经在dom节点上绑定过事件函数，那我们就算使用过发布订阅模式。
        <pre>{{ codedemo }}</pre>
        这里需要监控用户点击document.body的动作，但我们没有办法预知用户在什么时候进行点击，所以我们订阅document.body上的click事件，当body节点被点击时，body便会向订阅者
        发布这个消息。当然你也可以后续删除或新增新的订阅。
      </div>
    </div>

    <div>
      <h3>4.自定义事件</h3>
      <div>
        除了dom事件，我们也会尝试一些自定义事件，依靠自定义事件完成的发布订阅模式可以适用于各种js模式：<br />
        现在看看如何实现发布订阅模式：<br />
        1.首先指定好谁当发布者（比如售楼处）
        2.然后给发布者添加一个缓存列表，用于存放回调函数以便通知订阅者（售楼处的花名册）
        3.发布消息的时候，发布者遍历这个缓存队列，依次触发里面存放的订阅者回调函数（遍历花名册，挨个发短信）
        <br />
        最后，需要给回调函数里填入一些参数，订阅者可以接受这些参数，这很重要，比如售楼处需要给短信里加入房子单价，售价，面积等等信息。
        订阅者接受到这些消息后可以自行处理。
        <pre>{{ codedemo2 }}</pre>
      </div>
    </div>
  </div>
</template>
